zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam/include/same70b/pio/same70q20b.h
#define PIN_PD16C_SDRAMC_RAS                       _L_(112)     /**< SDRAMC signal: RAS on PD16 mux C*/
#define MUX_PD16C_SDRAMC_RAS                       _L_(2)       /**< SDRAMC signal line function value: RAS */
#define PIO_PD16C_SDRAMC_RAS                       (_UL_(1) << 16)

#define PIN_PC13C_SDRAMC_SDA10                     _L_(77)      /**< SDRAMC signal: SDA10 on PC13 mux C*/
#define MUX_PC13C_SDRAMC_SDA10                     _L_(2)       /**< SDRAMC signal line function value: SDA10 */
#define PIO_PC13C_SDRAMC_SDA10                     (_UL_(1) << 13)

#define PIN_PD13C_SDRAMC_SDA10                     _L_(109)     /**< SDRAMC signal: SDA10 on PD13 mux C*/
#define MUX_PD13C_SDRAMC_SDA10                     _L_(2)       /**< SDRAMC signal line function value: SDA10 */
#define PIO_PD13C_SDRAMC_SDA10                     (_UL_(1) << 13)

#define PIN_PD23C_SDRAMC_SDCK                      _L_(119)     /**< SDRAMC signal: SDCK on PD23 mux C*/
#define MUX_PD23C_SDRAMC_SDCK                      _L_(2)       /**< SDRAMC signal line function value: SDCK */
#define PIO_PD23C_SDRAMC_SDCK                      (_UL_(1) << 23)

#define PIN_PD14C_SDRAMC_SDCKE                     _L_(110)     /**< SDRAMC signal: SDCKE on PD14 mux C*/
#define MUX_PD14C_SDRAMC_SDCKE                     _L_(2)       /**< SDRAMC signal line function value: SDCKE */
#define PIO_PD14C_SDRAMC_SDCKE                     (_UL_(1) << 14)

#define PIN_PD29C_SDRAMC_SDWE                      _L_(125)     /**< SDRAMC signal: SDWE on PD29 mux C*/
#define MUX_PD29C_SDRAMC_SDWE                      _L_(2)       /**< SDRAMC signal line function value: SDWE */
#define PIO_PD29C_SDRAMC_SDWE                      (_UL_(1) << 29)

/* ========== PIO definition for SMC peripheral ========== */
#define PIN_PC18A_SMC_A0                           _L_(82)      /**< SMC signal: A0 on PC18 mux A*/
#define MUX_PC18A_SMC_A0                           _L_(0)       /**< SMC signal line function value: A0 */
#define PIO_PC18A_SMC_A0                           (_UL_(1) << 18)

#define PIN_PC18A_SMC_NBS0                         _L_(82)      /**< SMC signal: NBS0 on PC18 mux A*/
#define MUX_PC18A_SMC_NBS0                         _L_(0)       /**< SMC signal line function value: NBS0 */
#define PIO_PC18A_SMC_NBS0                         (_UL_(1) << 18)

#define PIN_PC19A_SMC_A1                           _L_(83)      /**< SMC signal: A1 on PC19 mux A*/
#define MUX_PC19A_SMC_A1                           _L_(0)       /**< SMC signal line function value: A1 */
#define PIO_PC19A_SMC_A1                           (_UL_(1) << 19)

#define PIN_PC20A_SMC_A2                           _L_(84)      /**< SMC signal: A2 on PC20 mux A*/
#define MUX_PC20A_SMC_A2                           _L_(0)       /**< SMC signal line function value: A2 */
#define PIO_PC20A_SMC_A2                           (_UL_(1) << 20)

#define PIN_PC21A_SMC_A3                           _L_(85)      /**< SMC signal: A3 on PC21 mux A*/
#define MUX_PC21A_SMC_A3                           _L_(0)       /**< SMC signal line function value: A3 */
#define PIO_PC21A_SMC_A3                           (_UL_(1) << 21)

#define PIN_PC22A_SMC_A4                           _L_(86)      /**< SMC signal: A4 on PC22 mux A*/
#define MUX_PC22A_SMC_A4                           _L_(0)       /**< SMC signal line function value: A4 */
#define PIO_PC22A_SMC_A4                           (_UL_(1) << 22)

#define PIN_PC23A_SMC_A5                           _L_(87)      /**< SMC signal: A5 on PC23 mux A*/
#define MUX_PC23A_SMC_A5                           _L_(0)       /**< SMC signal line function value: A5 */
#define PIO_PC23A_SMC_A5                           (_UL_(1) << 23)

#define PIN_PC24A_SMC_A6                           _L_(88)      /**< SMC signal: A6 on PC24 mux A*/
#define MUX_PC24A_SMC_A6                           _L_(0)       /**< SMC signal line function value: A6 */
#define PIO_PC24A_SMC_A6                           (_UL_(1) << 24)

#define PIN_PC25A_SMC_A7                           _L_(89)      /**< SMC signal: A7 on PC25 mux A*/
#define MUX_PC25A_SMC_A7                           _L_(0)       /**< SMC signal line function value: A7 */
#define PIO_PC25A_SMC_A7                           (_UL_(1) << 25)

#define PIN_PC26A_SMC_A8                           _L_(90)      /**< SMC signal: A8 on PC26 mux A*/
#define MUX_PC26A_SMC_A8                           _L_(0)       /**< SMC signal line function value: A8 */
#define PIO_PC26A_SMC_A8                           (_UL_(1) << 26)

#define PIN_PC27A_SMC_A9                           _L_(91)      /**< SMC signal: A9 on PC27 mux A*/
#define MUX_PC27A_SMC_A9                           _L_(0)       /**< SMC signal line function value: A9 */
#define PIO_PC27A_SMC_A9                           (_UL_(1) << 27)

#define PIN_PC28A_SMC_A10                          _L_(92)      /**< SMC signal: A10 on PC28 mux A*/
#define MUX_PC28A_SMC_A10                          _L_(0)       /**< SMC signal line function value: A10 */
#define PIO_PC28A_SMC_A10                          (_UL_(1) << 28)

#define PIN_PC29A_SMC_A11                          _L_(93)      /**< SMC signal: A11 on PC29 mux A*/
#define MUX_PC29A_SMC_A11                          _L_(0)       /**< SMC signal line function value: A11 */
#define PIO_PC29A_SMC_A11                          (_UL_(1) << 29)

#define PIN_PC30A_SMC_A12                          _L_(94)      /**< SMC signal: A12 on PC30 mux A*/
#define MUX_PC30A_SMC_A12                          _L_(0)       /**< SMC signal line function value: A12 */
#define PIO_PC30A_SMC_A12                          (_UL_(1) << 30)

#define PIN_PC31A_SMC_A13                          _L_(95)      /**< SMC signal: A13 on PC31 mux A*/
#define MUX_PC31A_SMC_A13                          _L_(0)       /**< SMC signal line function value: A13 */
#define PIO_PC31A_SMC_A13                          (_UL_(1) << 31)

#define PIN_PA18C_SMC_A14                          _L_(18)      /**< SMC signal: A14 on PA18 mux C*/
#define MUX_PA18C_SMC_A14                          _L_(2)       /**< SMC signal line function value: A14 */
#define PIO_PA18C_SMC_A14                          (_UL_(1) << 18)

#define PIN_PA19C_SMC_A15                          _L_(19)      /**< SMC signal: A15 on PA19 mux C*/
#define MUX_PA19C_SMC_A15                          _L_(2)       /**< SMC signal line function value: A15 */
#define PIO_PA19C_SMC_A15                          (_UL_(1) << 19)

