zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam/include/same70b/pio/same70q20b.h
#define PIN_PD15C_EBI_NBS1                         _L_(111)     /**< EBI signal: NBS1 on PD15 mux C*/
#define MUX_PD15C_EBI_NBS1                         _L_(2)       /**< EBI signal line function value: NBS1 */
#define PIO_PD15C_EBI_NBS1                         (_UL_(1) << 15)

#define PIN_PD16C_EBI_RAS                          _L_(112)     /**< EBI signal: RAS on PD16 mux C*/
#define MUX_PD16C_EBI_RAS                          _L_(2)       /**< EBI signal line function value: RAS */
#define PIO_PD16C_EBI_RAS                          (_UL_(1) << 16)

#define PIN_PC13C_EBI_SDA10                        _L_(77)      /**< EBI signal: SDA10 on PC13 mux C*/
#define MUX_PC13C_EBI_SDA10                        _L_(2)       /**< EBI signal line function value: SDA10 */
#define PIO_PC13C_EBI_SDA10                        (_UL_(1) << 13)

#define PIN_PD13C_EBI_SDA10                        _L_(109)     /**< EBI signal: SDA10 on PD13 mux C*/
#define MUX_PD13C_EBI_SDA10                        _L_(2)       /**< EBI signal line function value: SDA10 */
#define PIO_PD13C_EBI_SDA10                        (_UL_(1) << 13)

#define PIN_PD23C_EBI_SDCK                         _L_(119)     /**< EBI signal: SDCK on PD23 mux C*/
#define MUX_PD23C_EBI_SDCK                         _L_(2)       /**< EBI signal line function value: SDCK */
#define PIO_PD23C_EBI_SDCK                         (_UL_(1) << 23)

#define PIN_PD14C_EBI_SDCKE                        _L_(110)     /**< EBI signal: SDCKE on PD14 mux C*/
#define MUX_PD14C_EBI_SDCKE                        _L_(2)       /**< EBI signal line function value: SDCKE */
#define PIO_PD14C_EBI_SDCKE                        (_UL_(1) << 14)

#define PIN_PD29C_EBI_SDWE                         _L_(125)     /**< EBI signal: SDWE on PD29 mux C*/
#define MUX_PD29C_EBI_SDWE                         _L_(2)       /**< EBI signal line function value: SDWE */
#define PIO_PD29C_EBI_SDWE                         (_UL_(1) << 29)


#endif /* _SAME70Q20B_PIO_H_ */
